Name: Minhas Ahmed

# we import as follows:

In [2]:
import pandas as pd

In [3]:
import numpy as np

# Import data set"Laptop-Price.csv"

In [4]:
df = pd.read_csv("Laptop-Price.csv")
print(df)

     Company                                    Product            TypeName  \
0         HP                                     250 G6            Notebook
1       Acer                                   Aspire 3            Notebook
2       Asus                            ZenBook UX430UN           Ultrabook
3       Acer                                    Swift 3           Ultrabook
4         HP                                     250 G6            Notebook
...      ...                                        ...                 ...
1141    Dell                              Inspiron 3567            Notebook
1142    Asus  X556UJ-XO044T (i7-6500U/4GB/500GB/GeForce            Notebook
1143  Lenovo                             Yoga 500-14ISK  2 in 1 Convertible
1144  Lenovo                             Yoga 900-13ISK  2 in 1 Convertible
1145      HP        15-AC110nv (i7-6500U/6GB/1TB/Radeon            Notebook

      Inches                            ScreenResolution   Ram       OpSys  \
0       15.6                           Full HD 1920x1080   8GB       No OS
1       15.6                                    1366x768   4GB  Windows 10
2       14.0                           Full HD 1920x1080  16GB  Windows 10
3       14.0                 IPS Panel Full HD 1920x1080   8GB  Windows 10
4       15.6                                    1366x768   4GB       No OS
...      ...                                         ...   ...         ...
1141    15.6                                    1366x768   8GB       Linux
1142    15.6                                    1366x768   4GB  Windows 10
1143    14.0   IPS Panel Full HD / Touchscreen 1920x1080   4GB  Windows 10
1144    13.3  IPS Panel Quad HD+ / Touchscreen 3200x1800  16GB  Windows 10
1145    15.6                                    1366x768   6GB  Windows 10

     Cpu Brand       Cpu Model Cpu Rate  SSD  HDD  Flash Storage  Hybrid  \
0        Intel   Core i5 7200U   2.5GHz  256    0              0       0
1          AMD  A9-Series 9420     3GHz    0  500              0       0
2        Intel   Core i7 8550U   1.8GHz  512    0              0       0
3        Intel   Core i5 8250U   1.6GHz  256    0              0       0
4        Intel   Core i5 7200U   2.5GHz    0  500              0       0
...        ...             ...      ...  ...  ...            ...     ...
1141     Intel   Core i7 7500U   2.7GHz    0    1              0       0
1142     Intel   Core i7 6500U   2.5GHz    0  500              0       0
1143     Intel   Core i7 6500U   2.5GHz  128    0              0       0
1144     Intel   Core i7 6500U   2.5GHz  512    0              0       0
1145     Intel   Core i7 6500U   2.5GHz    0    1              0       0

     Gpu Brand         Gpu Model  Unnamed: 16  Price_euros
0        Intel   HD Graphics 620          NaN       575.00
1          AMD         Radeon R5          NaN       400.00
2       Nvidia     GeForce MX150          NaN      1495.00
3        Intel  UHD Graphics 620          NaN       770.00
4        Intel   HD Graphics 620          NaN       393.90
...        ...               ...          ...          ...
1141       AMD    Radeon R5 M430          NaN       805.99
1142    Nvidia      GeForce 920M          NaN       720.32
1143     Intel   HD Graphics 520          NaN       638.00
1144     Intel   HD Graphics 520          NaN      1499.00
1145       AMD    Radeon R5 M330          NaN       764.00

[1146 rows x 18 columns]

# Creating a series:

In [5]:
k = pd.Series([1, 3, 5, np.nan, 6, 8])
print(k)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# Datetime index using date_range and labeled columns:

In [6]:
dates = pd.date_range("20130101", periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

# Creating a DataFrame by passing a dictionary of objects:

In [7]:
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["HP", "Acer", "Dell", "Lenovo"]),
        "F": "full",
    }
)
print(df)

     A          B    C  D       E     F
0  1.0 2013-01-02  1.0  3      HP  full
1  1.0 2013-01-02  1.0  3    Acer  full
2  1.0 2013-01-02  1.0  3    Dell  full
3  1.0 2013-01-02  1.0  3  Lenovo  full

# columns of the resulting DataFrame:

In [8]:
df.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [9]:
df.head()

     A          B    C  D       E     F
0  1.0 2013-01-02  1.0  3      HP  full
1  1.0 2013-01-02  1.0  3    Acer  full
2  1.0 2013-01-02  1.0  3    Dell  full
3  1.0 2013-01-02  1.0  3  Lenovo  full

In [10]:
df.index

Index([0, 1, 2, 3], dtype='int64')

In [11]:
df.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'HP', 'full'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'Acer', 'full'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'Dell', 'full'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'Lenovo', 'full']],
      dtype=object)

In [12]:
df.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [13]:
df.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [14]:
df.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,HP,Acer,Dell,Lenovo
F,full,full,full,full

In [15]:
df.sort_index(axis=1, ascending=False)

      F       E  D    C          B    A
0  full      HP  3  1.0 2013-01-02  1.0
1  full    Acer  3  1.0 2013-01-02  1.0
2  full    Dell  3  1.0 2013-01-02  1.0
3  full  Lenovo  3  1.0 2013-01-02  1.0

In [16]:
df.sort_values(by="B")

     A          B    C  D       E     F
0  1.0 2013-01-02  1.0  3      HP  full
1  1.0 2013-01-02  1.0  3    Acer  full
2  1.0 2013-01-02  1.0  3    Dell  full
3  1.0 2013-01-02  1.0  3  Lenovo  full

In [17]:
m = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
print(m)

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [18]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
print(s)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [19]:
s = pd.Series(np.random.randint(0, 7, size=10))
print(s)

0    5
1    5
2    6
3    2
4    2
5    0
6    0
7    1
8    6
9    3
dtype: int32

In [20]:
s = pd.Series(["Dell", "HP", "Lenovo", "Acer", "Huawei", np.nan, "Samsung", "Apple", "Google Book"])
print(s)

0           Dell
1             HP
2         Lenovo
3           Acer
4         Huawei
5            NaN
6        Samsung
7          Apple
8    Google Book
dtype: object

In [21]:
df = pd.DataFrame(np.random.randn(10, 4))
print(df)

          0         1         2         3
0  0.745676  1.495334  1.059748 -0.364002
1 -0.881053 -1.659168 -1.547026  0.151399
2  0.426442  0.138596 -0.854912 -1.663440
3  0.613922  0.682541  0.212064 -0.760336
4  1.576991  0.212344  1.704871  0.032613
5 -0.582215  0.359230  0.454113 -0.844440
6  0.952587  0.246296  0.055492  0.524542
7 -2.764537 -0.318605 -0.666698 -0.631475
8  1.352836 -0.913439  1.046807 -0.282465
9  0.417815  0.034888  0.383150  1.913007

In [22]:
stacked = df.stack(future_stack=True)
print(stacked)

0  0    0.745676
   1    1.495334
   2    1.059748
   3   -0.364002
1  0   -0.881053
   1   -1.659168
   2   -1.547026
   3    0.151399
2  0    0.426442
   1    0.138596
   2   -0.854912
   3   -1.663440
3  0    0.613922
   1    0.682541
   2    0.212064
   3   -0.760336
4  0    1.576991
   1    0.212344
   2    1.704871
   3    0.032613
5  0   -0.582215
   1    0.359230
   2    0.454113
   3   -0.844440
6  0    0.952587
   1    0.246296
   2    0.055492
   3    0.524542
7  0   -2.764537
   1   -0.318605
   2   -0.666698
   3   -0.631475
8  0    1.352836
   1   -0.913439
   2    1.046807
   3   -0.282465
9  0    0.417815
   1    0.034888
   2    0.383150
   3    1.913007
dtype: float64

In [23]:
stacked.unstack()

          0         1         2         3
0  0.745676  1.495334  1.059748 -0.364002
1 -0.881053 -1.659168 -1.547026  0.151399
2  0.426442  0.138596 -0.854912 -1.663440
3  0.613922  0.682541  0.212064 -0.760336
4  1.576991  0.212344  1.704871  0.032613
5 -0.582215  0.359230  0.454113 -0.844440
6  0.952587  0.246296  0.055492  0.524542
7 -2.764537 -0.318605 -0.666698 -0.631475
8  1.352836 -0.913439  1.046807 -0.282465
9  0.417815  0.034888  0.383150  1.913007

In [24]:
df = pd.DataFrame(
    {
        "A": ["Company", "Product", "Type", "Quantity"] * 3,
        "B": ["Dell", "Lenovo", "HP"] * 4,
        "C": ["Note Book", "Note Book", "Note Book", "HD", "HD", "HD"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
print(df)

           A       B          C         D         E
0    Company    Dell  Note Book -0.607710 -0.745411
1    Product  Lenovo  Note Book -0.136599 -0.288973
2       Type      HP  Note Book  1.664244 -0.509543
3   Quantity    Dell         HD -2.215091  0.795762
4    Company  Lenovo         HD  1.096162 -1.863221
5    Product      HP         HD -0.078853  0.846207
6       Type    Dell  Note Book -0.661272 -0.722492
7   Quantity  Lenovo  Note Book -1.385481 -0.220839
8    Company      HP  Note Book  0.407332  1.618105
9    Product    Dell         HD  2.116897 -0.211085
10      Type  Lenovo         HD -0.666505  0.783269
11  Quantity      HP         HD  0.181915 -0.477576

In [25]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C                      HD  Note Book
A        B
Company  Dell         NaN  -0.607710
         HP           NaN   0.407332
         Lenovo  1.096162        NaN
Product  Dell    2.116897        NaN
         HP     -0.078853        NaN
         Lenovo       NaN  -0.136599
Quantity Dell   -2.215091        NaN
         HP      0.181915        NaN
         Lenovo       NaN  -1.385481
Type     Dell         NaN  -0.661272
         HP           NaN   1.664244
         Lenovo -0.666505        NaN

In [26]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    24426
Freq: 5min, dtype: int32

In [27]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06   -1.402274
2012-03-07   -0.091396
2012-03-08   -0.541617
2012-03-09   -0.572750
2012-03-10    0.901801
Freq: D, dtype: float64

In [28]:
print(df)

           A       B          C         D         E
0    Company    Dell  Note Book -0.607710 -0.745411
1    Product  Lenovo  Note Book -0.136599 -0.288973
2       Type      HP  Note Book  1.664244 -0.509543
3   Quantity    Dell         HD -2.215091  0.795762
4    Company  Lenovo         HD  1.096162 -1.863221
5    Product      HP         HD -0.078853  0.846207
6       Type    Dell  Note Book -0.661272 -0.722492
7   Quantity  Lenovo  Note Book -1.385481 -0.220839
8    Company      HP  Note Book  0.407332  1.618105
9    Product    Dell         HD  2.116897 -0.211085
10      Type  Lenovo         HD -0.666505  0.783269
11  Quantity      HP         HD  0.181915 -0.477576

In [29]:
print(df)

           A       B          C         D         E
0    Company    Dell  Note Book -0.607710 -0.745411
1    Product  Lenovo  Note Book -0.136599 -0.288973
2       Type      HP  Note Book  1.664244 -0.509543
3   Quantity    Dell         HD -2.215091  0.795762
4    Company  Lenovo         HD  1.096162 -1.863221
5    Product      HP         HD -0.078853  0.846207
6       Type    Dell  Note Book -0.661272 -0.722492
7   Quantity  Lenovo  Note Book -1.385481 -0.220839
8    Company      HP  Note Book  0.407332  1.618105
9    Product    Dell         HD  2.116897 -0.211085
10      Type  Lenovo         HD -0.666505  0.783269
11  Quantity      HP         HD  0.181915 -0.477576